app/Controllers/Livros.php

    public function listar(): string
    {
        $data = []; // crie um array vazio
        //$data['livros'] = ["Harry Potter", "Senhos dos Anéis", "Crônicas de Nárnia"];

        $livrosModel = new LivrosModel();
        $data['livros'] = $livrosModel->findAll();
---
SELECT *
FROM `livros`

    public function inserir_teste()
    {
        //exit(); // este comando só deve ser executado uma vez
        $livrosModel = new LivrosModel();
        $agora = new Time('now');

        $livrosModel->save([
            'titulo'=>'Teste',
            'autor'=>'Autor Teste',
            'created_at'=>$agora,
            'updated_at'=>$agora
        ]);

        print_r($livrosModel->findAll());
---
INSERT INTO `livros` (`titulo`, `autor`, `created_at`, `updated_at`) VALUES ('Teste', 'Autor Teste', '2025-07-10 12:38:37', '2025-07-10 12:38:37')
SELECT *
FROM `livros`

    public function deletar($id){
        /* Remove um livro com base no ID fornecido */

        $livrosModel = new LivrosModel();
        $livrosModel->delete(['id' => $id]);
---
DELETE FROM `livros`
WHERE `id` IN ('18')